schemas/riv-schemas/interactions/GetCareDocumentationInteraction/GetCareDocumentationInteraction_2.1_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='GetCareDocumentationInteraction' 
	xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' 
	xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' 
	xmlns:xs='http://www.w3.org/2001/XMLSchema' 
	xmlns:tjsr='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentationResponder:2' 
	xmlns:tjsi='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentationInitiator:2' 
	xmlns:tns='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentation:2:rivtabp21' 
	targetNamespace='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentation:2:rivtabp21' 
	xmlns:itr='urn:riv:itintegration:registry:1'>

  <xs:annotation>
    <xs:documentation>
			 Tjänsteinteraktionens namn: GetCareDocumentationInteraction
			 Beskrivning: 
			   Request care documentation for a subject of care
			 Revisioner: 
			 Tjänstedomän: clinicalprocess:healthcond:description
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP21
			 Förvaltas av: Sveriges Kommuner och Landsting
			 </xs:documentation>
  </xs:annotation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentation:2:rivtabp21'>
      <xs:import schemaLocation='GetCareDocumentationResponder_2.1.xsd' namespace='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentationResponder:2' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='GetCareDocumentationRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
  		<wsdl:documentation>
			National: The HSA-id of Inera AB ("national" aggregation service)
			Regional: The HSA-id of Inera AB (regional aggregation service)
			Specific Source system: The HSA-id of the source system
		</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:GetCareDocumentation' />
  </wsdl:message>
  <wsdl:message name='GetCareDocumentationResponse'>
    <wsdl:part name='parameters' element='tjsr:GetCareDocumentationResponse' />
  </wsdl:message>
  <wsdl:portType name='GetCareDocumentationResponderInterface'>
    <wsdl:operation name='GetCareDocumentation'>
      <wsdl:input message='tns:GetCareDocumentationRequest' />
      <wsdl:output message='tns:GetCareDocumentationResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='GetCareDocumentationResponderBinding' type='tns:GetCareDocumentationResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='GetCareDocumentation'>
      <soap:operation soapAction='urn:riv:clinicalprocess:healthcond:description:GetCareDocumentationResponder:2:GetCareDocumentation' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:GetCareDocumentationRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='GetCareDocumentationResponderService'>
    <wsdl:port name='GetCareDocumentationResponderPort' binding='tns:GetCareDocumentationResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
