test/non-functional/gatling/src/test/resources/bodies/GetCareDocumentationRequest.xml

<soapenv:Envelope 
   xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
   xmlns:urn="urn:riv:itintegration:registry:1" 
   xmlns:urn1="urn:riv:clinicalprocess:healthcond:description:GetCareDocumentationResponder:2" 
   xmlns:urn2="urn:riv:clinicalprocess:healthcond:description:2">
   <soapenv:Header>
      <urn:LogicalAddress>VS-1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetCareDocumentation>
         <urn1:patientId>
            <urn2:id>${patientId}</urn2:id>
            <urn2:type>1.2.752.129.2.1.3.1</urn2:type>
         </urn1:patientId>
      </urn1:GetCareDocumentation>
   </soapenv:Body>
</soapenv:Envelope>